.emacs.d/config.el
(defun swap-buffers-in-windows ()
  "Put the buffer from the selected window in next window, and vice versa"
  (interactive)
  (let* ((this (selected-window))
     (other (next-window))
     (this-buffer (window-buffer this))
     (other-buffer (window-buffer other)))
    (set-window-buffer other this-buffer)
    (set-window-buffer this other-buffer)
    )
  )
  (global-set-key (kbd "C-c s") 'swap-buffers-in-windows)

(global-set-key (kbd "s-<f1>")
  (lambda ()
    (interactive)
    (dired "~/")))

(setq auto-window-vscroll nil)
(setq next-line-add-newlines t)

(set-face-attribute 'default nil :height 200)

(set-frame-parameter (selected-frame) 'alpha '(100 . 100))
(add-to-list 'default-frame-alist '(alpha . (100 . 100)))

(line-number-mode 1)
(column-number-mode 1)

(global-subword-mode 1)

(scroll-bar-mode -1)
(tool-bar-mode -1)
(menu-bar-mode -1)

(defalias 'yes-or-no-p 'y-or-n-p)

(setq ring-bell-function 'ignore)

(setq electric-pair-pairs '(
			    (?\( . ?\))
			    (?\[ . ?\])
			    (?\{ . ?\})
			    (?\" . ?\")
			    ))
(electric-pair-mode t)

(global-prettify-symbols-mode 1)

;;  (when window-system (global-hl-line-mode t))

(setq scroll-conservatively 100)

(global-set-key (kbd "<s-M-return>") 'vterm)

(setq inhibit-startup-message t)

(use-package vterm
    :ensure t)

(setq backup-directory-alist '(("" . "~/.emacs.d/backup")))

(setq confirm-kill-processes nil)

(setq x-select-enable-clipboard t)

(cua-selection-mode t)

(defun er-sudo-edit (&optional arg)
  "Edit currently visited file as root.

With a prefix ARG prompt for a file to visit.
Will also prompt for a file to visit if current
buffer is not visiting a file."
  (interactive "P")
  (if (or arg (not buffer-file-name))
      (find-file (concat "/sudo:root@localhost:"
			 (ido-read-file-name "Find file(as root): ")))
    (find-alternate-file (concat "/sudo:root@localhost:" buffer-file-name))))

(global-set-key (kbd "C-x C-r") #'er-sudo-edit)

(defun win-resize-top-or-bot ()
  "Figure out if the current window is on top, bottom or in the
middle"
  (let* ((win-edges (window-edges))
	 (this-window-y-min (nth 1 win-edges))
	 (this-window-y-max (nth 3 win-edges))
	 (fr-height (frame-height)))
    (cond
     ((eq 0 this-window-y-min) "top")
     ((eq (- fr-height 1) this-window-y-max) "bot")
     (t "mid"))))

(defun win-resize-left-or-right ()
  "Figure out if the current window is to the left, right or in the
middle"
  (let* ((win-edges (window-edges))
	 (this-window-x-min (nth 0 win-edges))
	 (this-window-x-max (nth 2 win-edges))
	 (fr-width (frame-width)))
    (cond
     ((eq 0 this-window-x-min) "left")
     ((eq (+ fr-width 4) this-window-x-max) "right")
     (t "mid"))))

(defun win-resize-enlarge-horiz ()
  (interactive)
  (cond
   ((equal "top" (win-resize-top-or-bot)) (enlarge-window -7))
   ((equal "bot" (win-resize-top-or-bot)) (enlarge-window 7))
   ((equal "mid" (win-resize-top-or-bot)) (enlarge-window -7))
   (t (message "nil"))))

(defun win-resize-minimize-horiz ()
  (interactive)
  (cond
   ((equal "top" (win-resize-top-or-bot)) (enlarge-window 7))
   ((equal "bot" (win-resize-top-or-bot)) (enlarge-window -7))
   ((equal "mid" (win-resize-top-or-bot)) (enlarge-window 7))
   (t (message "nil"))))

(defun win-resize-enlarge-vert ()
  (interactive)
  (cond
   ((equal "left" (win-resize-left-or-right)) (enlarge-window-horizontally -7))
   ((equal "right" (win-resize-left-or-right)) (enlarge-window-horizontally 7))
   ((equal "mid" (win-resize-left-or-right)) (enlarge-window-horizontally -7))))

(defun win-resize-minimize-vert ()
  (interactive)
  (cond
   ((equal "left" (win-resize-left-or-right)) (enlarge-window-horizontally 7))
   ((equal "right" (win-resize-left-or-right)) (enlarge-window-horizontally -7))
   ((equal "mid" (win-resize-left-or-right)) (enlarge-window-horizontally 7))))

(global-set-key [M-s-down] 'win-resize-minimize-vert)
(global-set-key [M-s-up] 'win-resize-enlarge-vert)
(global-set-key [M-s-left] 'win-resize-minimize-horiz)
(global-set-key [M-s-right] 'win-resize-enlarge-horiz)
(global-set-key [M-s-up] 'win-resize-enlarge-horiz)
(global-set-key [M-s-down] 'win-resize-minimize-horiz)
(global-set-key [M-s-left] 'win-resize-enlarge-vert)
(global-set-key [M-s-right] 'win-resize-minimize-vert)

;;(setq default-frame-alist
  ;;    '((background-color . "0x282a36")
;;	(foreground-color . "0xbbc5ff")))

(defvar my-term-shell "/bin/bash")
    (defadvice ansi-term (before force-bash)
      (interactive (list my-term-shell)))
    (ad-activate 'ansi-term)

(autoload 'ansi-color-for-comint-mode-on "ansi-color" nil t)
(add-hook 'shell-mode-hook 'ansi-color-for-comint-mode-on)

(use-package which-key
  :ensure t
  :init
  (which-key-mode))

(use-package hungry-delete
  :ensure t
  :config (global-hungry-delete-mode))

(use-package beacon
  :ensure t
  :init
  (beacon-mode 1))

(use-package sudo-edit
  :ensure t
  :bind ("s-e" . sudo-edit))

(use-package spaceline
  :ensure t
  :config
  (require 'spaceline-config)
  (setq powerline-default-separator (quote arrow))
  (spaceline-spacemacs-theme))

(use-package diminish
  :ensure t
  :init
  (diminish 'hungry-delete-mode)
  (diminish 'beacon-mode)
  (diminish 'company-mode)
  (diminish 'subword-mode)
  (diminish 'which-key-mode)
  (diminish 'rainbow-mode)
  (diminish 'rainbow-delimiters-mode)
  (diminish 'impatient-mode))

(add-to-list 'display-buffer-alist
		      `(,(rx bos "*helm" (* not-newline) "*" eos)
			   (display-buffer-in-side-window)
			   (inhibit-same-window . t)
			   (window-height . 0.3)))
(require 'helm-config)
  (use-package helm
    :ensure t
    :demand
    :bind (("M-x" . helm-M-x)
	   ("C-x C-f" . helm-find-files)
	   ("C-x b" . helm-buffers-list)
	   ("C-x c o" . helm-occur) ;SC
	   ("M-y" . helm-show-kill-ring) ;SC
	   ("C-x r b" . helm-filtered-bookmarks) ;SC
	   ("C-x C-b" . helm-buffers-list))
    :requires helm-config
    :config (helm-mode 1))

;; fuzzy file finder
(use-package fiplr
:ensure t
:config
(setq fiplr-root-markers '(".git" ".svn"))
(setq fiplr-ignored-globs '((directories (".git" ".svn"))
(files ("*.jpg" "*.png" "*.zip" "*~"))))
(global-set-key (kbd "C-z") 'helm-fzf))

(use-package dmenu
  :ensure t
  :bind
  ("s-SPC" . 'dmenu))

(use-package symon
  :ensure t
  :bind
  ("s-h" . 'symon-mode))

(setq org-src-window-setup 'current-window)
(add-to-list 'org-structure-template-alist
	     '("el" "#+BEGIN_SRC emacs-lisp\n?\n#+END_SRC"))
(add-to-list 'org-structure-template-alist
	     '("iex" "#+BEGIN_SRC elixir\n?\n#+END_SRC"))

(use-package org-bullets
  :ensure t
  :config
  (add-hook 'org-mode-hook (lambda () (org-bullets-mode)))
  (add-hook 'org-mode-hook 'prettify-symbols-mode))

(use-package rainbow-delimiters
    :ensure t
    :init 
(add-hook 'prog-mode-hook 'rainbow-delimiters-mode))
